//======================================
// ノーツの処理[note.cpp]
// Author : 染矢　晃介
//======================================
#include "notecontroller.h"

//======================================
// コンストラクタ
//======================================
NoteController::NoteController()
{
	
}

//=====================================
//デストラクタ
//=====================================
NoteController::~NoteController()
{

}

//=====================================
//更新処理
//=====================================
void NoteController::Update()
{
	//BGMから情報を取得
	//Noteに情報を与える
}

//=====================================
//
//=====================================
//D3DXVECTOR3 NoteController::GetNotePos()
//{
//	return ctrl->pos;
//}