//======================================
// ノーツの描画処理[noteview.cpp]
// Author : 染矢　晃介
//======================================
#include "noteview.h"
#include "note.h"

//=====================================
//コンストラクタ
//=====================================
NoteView::NoteView()
{
	Note *note;//インスタンス
}

//=====================================
//デストラクタ
//=====================================
NoteView :: ~NoteView()
{
	//終了処理
	//テクスチャの解放
	//頂点バッファの解放
}

//=====================================
//描画処理
//=====================================
void NoteView::Draw()
{
	//Noteから情報をGet
	D3DXVECTOR3 pos = note->GetPos();
	D3DXVECTOR3 scl = note->GetScl();
	D3DXMATRIX  mtxWorld = note->GetMtxWorld();

}