//=============================================================================
//
// タイトル画面の定義 [title.h]
// Author : 李尚ミン
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"
//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_TITLE "data/TEXTURE/title.png"

//===========================
//プロトタイプ宣言
//===========================
//初期化
HRESULT InitTitle();
//終了処理
void UninitTitle();
//更新処理
void UpdateTitle();
//描画処理
void DrawTitle();
//頂点作成処理
void MakeVertexTitle();

#endif