//=============================================================================
//
// チュートリアルの定義 [tutorial.h]
// Author : 李尚ミン
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "main.h"

//=================================
// マクロ定義
//=================================


//===============================
//プロトタイプ宣言
//===============================

	//初期化
	HRESULT InitTutorial();
	//終了処理
	void	UninitTutorial();
	//更新処理
	void	UpdateTutorial();
	//描画処理
	void	DrawTutorial();

	void SetTitleBGM();

#endif
